app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movie.all

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at", "director") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", ""], ["updated_at", "2025-10-23 05:29:47.572397"], ["id", 1]]
---
  def update
    if @movie.update(movie_params)

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
  def destroy
    @movie.destroy

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND "movies"."id" != ?  [["director", "Ridley Scott"], ["id", 1]]
---
  def similar
    @movie = Movie.find(params[:id])
    if @movie.director.blank?

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_movie
    @movie = Movie.find(params[:id])